In [52]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

- column 수정

In [11]:
df['주소'].replace({'광주':'광주전남'})

번호
1번    광주전남
2번      서울
3번      대구
4번      대전
5번    광주전남
6번      서울
Name: 주소, dtype: object

In [12]:
df['주소'].replace({'광주':'광주전남', '서울':'특별시'})

번호
1번    광주전남
2번     특별시
3번      대구
4번      대전
5번    광주전남
6번     특별시
Name: 주소, dtype: object

In [42]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [46]:
df['언어'].str.lower(), df['언어'].str.upper(), df['주소'] + '시', df['점수'].astype(str) + '점'

(번호
 1번    python
 2번      java
 3번       c++
 4번       NaN
 5번       NaN
 6번         c
 Name: 언어, dtype: object,
 번호
 1번    PYTHON
 2번      JAVA
 3번       C++
 4번       NaN
 5번       NaN
 6번         C
 Name: 언어, dtype: object,
 번호
 1번    광주시
 2번    서울시
 3번    대구시
 4번    대전시
 5번    광주시
 6번    서울시
 Name: 주소, dtype: object,
 번호
 1번     76점
 2번     88점
 3번     98점
 4번    100점
 5번     60점
 6번     90점
 Name: 점수, dtype: object)

In [5]:
df['언어'] = df['언어'].str.lower()
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  python
2번  이길동  서울  23   88    java
3번  강길동  대구  30   98     c++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       c

In [6]:
df['언어'] = df['언어'].str.upper()
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  PYTHON
2번  이길동  서울  23   88    JAVA
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [7]:
df['주소'] = df['주소'] + '시'
df

     이름   주소  나이   점수      언어
번호
1번  김길동  광주시  33   76  PYTHON
2번  이길동  서울시  23   88    JAVA
3번  강길동  대구시  30   98     C++
4번  홍길동  대전시  20  100     NaN
5번  박길동  광주시  21   60     NaN
6번  나길동  서울시  25   90       C

In [22]:
df['점수'].astype(str) + '점'

번호
1번     76점
2번     88점
3번     98점
4번    100점
5번     60점
6번     90점
Name: 점수, dtype: object

In [21]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

#### column 추가

In [8]:
df['총합'] = df['나이'] * df['점수']
df

     이름   주소  나이   점수      언어    총합
번호
1번  김길동  광주시  33   76  PYTHON  2508
2번  이길동  서울시  23   88    JAVA  2024
3번  강길동  대구시  30   98     C++  2940
4번  홍길동  대전시  20  100     NaN  2000
5번  박길동  광주시  21   60     NaN  1260
6번  나길동  서울시  25   90       C  2250

In [9]:
df['결과'] = 'Fail'

In [48]:
df

     이름  주소  나이   점수      언어    총합
번호
1번  김길동  광주  33   76  Python  2508
2번  이길동  서울  23   88    Java  2024
3번  강길동  대구  30   98     C++  2940
4번  홍길동  대전  20  100     NaN  2000
5번  박길동  광주  21   60     NaN  1260
6번  나길동  서울  25   90       C  2250

In [53]:
df['총합'] = df['나이'] * df['점수']
df['결과'] = 'Fail'
df.loc[df['총합']>2200 , '결과'] = 'Pass'
df

     이름  주소  나이   점수      언어    총합    결과
번호
1번  김길동  광주  33   76  Python  2508  Pass
2번  이길동  서울  23   88    Java  2024  Fail
3번  강길동  대구  30   98     C++  2940  Pass
4번  홍길동  대전  20  100     NaN  2000  Fail
5번  박길동  광주  21   60     NaN  1260  Fail
6번  나길동  서울  25   90       C  2250  Pass

In [11]:
df.loc[df['총합']>2200 , '결과'] = 'Pass'
df

     이름   주소  나이   점수      언어    총합    결과
번호
1번  김길동  광주시  33   76  PYTHON  2508  Pass
2번  이길동  서울시  23   88    JAVA  2024  Fail
3번  강길동  대구시  30   98     C++  2940  Pass
4번  홍길동  대전시  20  100     NaN  2000  Fail
5번  박길동  광주시  21   60     NaN  1260  Fail
6번  나길동  서울시  25   90       C  2250  Pass

#### column 삭제

In [12]:
df.drop(columns=['총합'])

     이름   주소  나이   점수      언어    결과
번호
1번  김길동  광주시  33   76  PYTHON  Pass
2번  이길동  서울시  23   88    JAVA  Fail
3번  강길동  대구시  30   98     C++  Pass
4번  홍길동  대전시  20  100     NaN  Fail
5번  박길동  광주시  21   60     NaN  Fail
6번  나길동  서울시  25   90       C  Pass

In [13]:
df

     이름   주소  나이   점수      언어    총합    결과
번호
1번  김길동  광주시  33   76  PYTHON  2508  Pass
2번  이길동  서울시  23   88    JAVA  2024  Fail
3번  강길동  대구시  30   98     C++  2940  Pass
4번  홍길동  대전시  20  100     NaN  2000  Fail
5번  박길동  광주시  21   60     NaN  1260  Fail
6번  나길동  서울시  25   90       C  2250  Pass

#### row 삭제

In [15]:
df.drop(index='4번')

     이름   주소  나이  점수      언어    총합    결과
번호
1번  김길동  광주시  33  76  PYTHON  2508  Pass
2번  이길동  서울시  23  88    JAVA  2024  Fail
3번  강길동  대구시  30  98     C++  2940  Pass
5번  박길동  광주시  21  60     NaN  1260  Fail
6번  나길동  서울시  25  90       C  2250  Pass

In [16]:
df

     이름   주소  나이   점수      언어    총합    결과
번호
1번  김길동  광주시  33   76  PYTHON  2508  Pass
2번  이길동  서울시  23   88    JAVA  2024  Fail
3번  강길동  대구시  30   98     C++  2940  Pass
4번  홍길동  대전시  20  100     NaN  2000  Fail
5번  박길동  광주시  21   60     NaN  1260  Fail
6번  나길동  서울시  25   90       C  2250  Pass

In [18]:
cond = df['점수']<80
df[cond]

     이름   주소  나이  점수      언어    총합    결과
번호
1번  김길동  광주시  33  76  PYTHON  2508  Pass
5번  박길동  광주시  21  60     NaN  1260  Fail

In [19]:
df[cond].index

Index(['1번', '5번'], dtype='object', name='번호')

In [20]:
df.drop(index=df[cond].index)

     이름   주소  나이   점수    언어    총합    결과
번호
2번  이길동  서울시  23   88  JAVA  2024  Fail
3번  강길동  대구시  30   98   C++  2940  Pass
4번  홍길동  대전시  20  100   NaN  2000  Fail
6번  나길동  서울시  25   90     C  2250  Pass